In [14]:
import pandas as pd

In [15]:
import numpy as np

In [16]:
pd.set_option('display.precision', 1)

In [17]:
row1 = [1.0, 2.0, np.nan ]
row2 = [5.0, np.nan, 8.0 ]
row3 = [np.nan, 20.0, 30.0 ]

rows = {'column1': row1,
     'column2': row2,
     'column_3': row3}

In [18]:
df = pd.DataFrame(rows)
df2 = pd.DataFrame(rows)

In [19]:
df

   column1  column2  column_3
0      1.0      5.0       NaN
1      2.0      NaN      20.0
2      NaN      8.0      30.0

In [20]:
df2

   column1  column2  column_3
0      1.0      5.0       NaN
1      2.0      NaN      20.0
2      NaN      8.0      30.0

In [21]:
df.mean(axis=1)

0     3.0
1    11.0
2    19.0
dtype: float64

In [22]:
df2.mean(axis=0)

column1      1.5
column2      6.5
column_3    25.0
dtype: float64

In [24]:
df.fillna(df.mean(axis=1))

   column1  column2  column_3
0      1.0      5.0       NaN
1      2.0      NaN      20.0
2      NaN      8.0      30.0

In [ ]:
df2.fillna(df2.mean(axis=0))